---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.Erase(Autodesk.Revit.DB.PaperSource)
source: html/375160e8-715b-c110-38e2-e8f9f4cf4023.htm
---
# Autodesk.Revit.DB.PaperSourceSet.Erase Method

Removes a specified object from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	PaperSource item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PaperSource`) - The item to be erased.

## Returns
The number of items that were erased from the set.